{
	"tabTitle": {
		"nl": "Persoonlijk",
		"en": "About me"
	},
	"title": {
		"nl": "Persoonlijk",
		"en": "About me"
	},
	"content": [
		{
			"type": "paragraph",
			"class": "",
			"onClick": "",
			"nl": "Mijn naam is Arthur van Strien. Ik heb een brede interesse in techniek, van software tot waterstaatkundige werken. Als programmeur ben ik beroepsmatig bezig met mijn hobby. Verder ben ik in mijn vrije tijd bezig met fotografie (zie hiervoor de fotografie pagina), reizen en fietsen. Ik knutsel graag, van houtbewerking tot solderen. Hiermee creëer ik een praktische oplossing voor ieder project.  ",
			"en": "My name is Arthur van Strien. I have a broad interest in technology, from software to hydraulic engineering works. As a programmer, I am professionally involved in my hobby. In my spare time I am also busy with photography (see the photography page), travelling and cycling. I like to do crafts, from woodworking to soldering. With these skills I create a practical solution for every project."
		},
		{
			"type": "header2",
			"class": "",
			"onClick": "",
			"nl": "Opleidingen:",
			"en": "Education:"
		},
		{
			"type": "image",
			"class": "shared-content-pictureThirdRightWrap",
			"onClick": "",
			"path": "pic_aboutme/P1870745.jpg"
		},
		{
			"type": "listItem",
			"class": "",
			"onClick": "",
			"nl": "Applicatieontwikkeling (MBO-4):  Tijdens deze opleiding heb ik een basis geleerd van de ICT. Daar onder valt: het kunnen onderhouden en aanleggen van simpele computernetwerken, het bouwen en onderhouden van computers en samenwerken en communiceren met collega’s en klanten. Denk hierbij aan Scrum en  e-mailcommunicatie. De opleiding heeft mij meer diepgaande kennis geleerd over het bouwen van websites, webapplicaties en web-api’s. Tijdens deze opleiding heb ik er voor gekozen om een aantal jaar van mijn reguliere lestijd te besteden in een leerwerkbedrijf. In dit leerwerkbedrijf werkte ik aan projecten die in de praktijk echt gebruikt worden. Dit heeft mij een goede ervaring op de werkvloer opgeleverd. Ik heb deze opleiding afgerond en een diploma ontvangen.",
			"en": "Application development (MBO-4 / Community College / Further Education Colleges): During this course, I learned the basics of IT.  This includes constructing and maintaining basic computer networks, constructing and maintaining computer and communication with co-workers and customers. For example the process framework Scrum and proper communication by email. The course has taught me a more profound knowledge about websites, web applications and web-API. For a few years, I worked on projects in an apprenticeship company within the course. This was instead of the usual lessons. This was an educational and interesting experience because the projects were made to be used and not just for practice. This meant that there was contact with real customers and has given me a good experience on the work floor."
		},
		{
			"type": "listItem",
			"class": "",
			"onClick": "",
			"nl": "Technische Informatica (HBO-Bachelor): Tijdens deze opleiding ben ik mij gaan verdiepen in programmeren op hardware niveau. Ook heb ik meer geleerd over de processen om software te ontwikkelen in teamverband. Deze opleiding heb ik niet af kunnen maken. Maar ik ben met de stof nog wel beroeps- en hobbymatig bezig. Daarom bevat deze website veel informatie die met Technische Informatica te maken heeft.",
			"en": "Applied Computer Science (HBO-Bachelor / University of Applied Sciences-Undergraduate): During this course, I started to study programming at the hardware level. Further, I broadened my knowledge about the processes used by developing software in teams. I did not finish the course, but I did not forget what I learned and still use this knowledge for professional and personal projects. That's why this website contains a lot of information related to Applied Computer Science."
		},
		{
			"type": "header2",
			"class": "",
			"onClick": "",
			"nl": "Vaardigheden:",
			"en": "Skills:"
		},
		{
			"type": "listItem",
			"class": "",
			"onClick": "",
			"nl": "Talen: Nederlands, Engels",
			"en": "Languages: Dutch, English"
		},
		{
			"type": "listItem",
			"class": "",
			"onClick": "",
			"nl": "Programmeertalen: C#, PHP, Javascript / JQuery, Java, HTML5, CSS3, SQL, Asp.net",
			"en": "Programming Languages: C#, PHP, Javascript / JQuery, Java, HTML5, CSS3, SQL, Asp.net"
		},
		{
			"type": "listItem",
			"class": "",
			"onClick": "",
			"nl": "Programmeertalen (beginner): C, C++ momenteel door middel van cursus mijn niveau hierin aan het verhogen.",
			"en": "Programming Languages (beginner): C, C++ At the moment, I am following a course to improve my level in these languages."
		},
		{
			"type": "listItem",
			"class": "",
			"onClick": "",
			"nl": "Handvaardigheden: Solderen, Hete lucht solderen, verder in het algemeen handig met een hamer / zaag / steeksleutel.",
			"en": "Manual Skills: Soldering, Hot air soldering, further generally useful with a hammer / saw / spanner."
		},
		{
			"type": "listItem",
			"class": "",
			"onClick": "",
			"nl": "Communicatieve vaardigheden: Ik ben in staat om op een professionele en nette manier te communiceren met klanten en collega's. Daarbij kan ik mijn keuze in technische termen aanpassen op het technische niveau van de klant of collega. Verder gevorderd in het ontvangen en geven van feedback en in staat verschillende rollen aan te nemen bij een vergadering.",
			"en": "Communication skills: I can communicate professionally and neatly with customers and colleagues. I can adapt my choice in technical terms to the technical level of the customer or colleague. Further advanced in receiving and giving feedback and able to take on different roles in a meeting."
		},
		{
			"type": "listItem",
			"class": "",
			"onClick": "",
			"nl": "Projectmanagement: Ervaring met agile ontwikelmethoden zoals Scrum en lessen gehad in Extreme Programming en de watervalmethode. Enkele jaren ervaring met het documenteren van API's en projecten. Beginner in het gebruik van UML.",
			"en": "Project management: Experience with agile development methods such as Scrum and followed lessons in Extreme Programming and the waterfall model. Several years of experience in documenting APIs and projects. Beginner in the use of UML."
		},
		{
			"type": "listItem",
			"class": "",
			"onClick": "",
			"nl": "Gereedschappen / Tools: Visual Studio, Android Studio, IntelliJ, SourceTree, GitKraken, Postman, Word, Github, Trello, Grammarly, Fiddler, Wireshark, Adobe Lightroom",
			"en": "Tools: Visual Studio, Android Studio, IntelliJ, SourceTree, GitKraken, Postman, Word, Github, Trello, Grammarly, Fiddler, Wireshark, Adobe Lighroom"
		},
		{
			"type": "listItem",
			"class": "",
			"onClick": "",
			"nl": "Andere vaardigheden: Ik ben in staat om computers te assembleren, aan te passen en te repareren. Ook kan ik daarbij het benodigde besturingssysteem installeren en de software gebruiksklaar maken. Verder kan ik ook advies geven over het upgraden van systemen en ben ik in staat om kleine (thuis) netwerken aan te leggen.",
			"en": "Other skills: I can assemble, modify and repair computers. This includes the installation of the operating system and making the software of the system ready for use.  I can also advise on system upgrades and I can build and maintain small (home) networks."
		},
		{
			"type": "lineSpace"
		},
		{
			"type": "paragraph",
			"class": "",
			"onClick": "",
			"nl": "Wanneer ik alle bovenstaande vaardigheden combineer stelt dat mij in staat om prototypes van producten te maken. Dit houd in: ontwerpen en schrijven van de software, het bouwen van de hardware en het controleren en testen van het resultaat. Eventuele gevonden gebreken kan ik dan op professionele manier documenteren en zorgen dat deze gecorrigeerd worden.",
			"en": "All the above skills combined enable me to make prototypes of products. This includes: designing and writing the software, building the hardware and checking and testing the result. If any defects are found, I can professionally document them and make sure they are corrected."
		},
		{
			"type": "header2",
			"class": "",
			"onClick": "",
			"nl": "Contact:",
			"en": "Contact information:"
		},
		{
			"type": "table",
			"class": "",
			"onClick": "",
			"rowHeaders": [

			],
			"rowData": [
				[
					{
						"nl": "E-mail:",
						"en": "Email:"
					},
					{
						"nl": "<a href='mailto:arthur@arthurvanstrien.nl' class='shared-content-inlineLinkBlue'>arthur@arthurvanstrien.nl</a>",
						"en": "<a href='mailto:arthur@arthurvanstrien.nl' class='shared-content-inlineLinkBlue'>arthur@arthurvanstrien.nl</a>"
					}
					
				],
				[
					{
						"nl": "Linkedin:",
						"en": "Linkedin:"
					},
					{
						"nl": "<a href='https://www.linkedin.com/in/arthur-van-strien-2b7a06158/' class='shared-content-inlineLinkBlue' target='_blank'>Linkedin</a>",
						"en": "<a href='https://www.linkedin.com/in/arthur-van-strien-2b7a06158/' class='shared-content-inlineLinkBlue' target='_blank'>Linkedin</a>"
					}
				],
								[
					{
						"nl": "Github:",
						"en": "Github:"
					},
					{
						"nl": "<a href='https://github.com/arthurvanstrien' class='shared-content-inlineLinkBlue' target='_blank'>Github</a>",
						"en": "<a href='https://github.com/arthurvanstrien' class='shared-content-inlineLinkBlue' target='_blank'>Github</a>"
					}
				],
								[
					{
						"nl": "Youtube:",
						"en": "Youtube:"
					},
					{
						"nl": "<a href='https://www.youtube.com/channel/UCOfR0UHPyuNp4WcoqbyF1Zw' class='shared-content-inlineLinkRed' target='_blank'>Youtube</a>",
						"en": "<a href='https://www.youtube.com/channel/UCOfR0UHPyuNp4WcoqbyF1Zw' class='shared-content-inlineLinkRed' target='_blank'>Youtube</a>"
					}
				]
			]
		}
	]
}